
@ prebuilt personName


> Define phrase list for Name property.
@ phraselist NamePhrases(interchangeable)=
		- name

> Define property entity and optional value for Name property.
@ ml NameProperty usesFeature NamePhrases
    - @ personName personName

> Define operations on 'Name' property.
@ ml Add() usesFeature AddPhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName

@ ml Remove() usesFeature RemovePhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName

@ ml Clear() usesFeature ClearPhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName

@ ml Change() usesFeature ChangePhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName

@ ml Show() usesFeature ShowPhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName

@ ml Help() usesFeature HelpPhrases
	-@ ml NameProperty usesFeature NameProperty
		- @ personName personName


> Add examples for operations on the 'Name' property to the intent 'sandwich'.
# sandwich
>> entity: Standalone NameProperty with personName
- {@NameProperty={@personName=Bart Simpson}}
- {@NameProperty={@personName=Thomas Matthews}}
- {@NameProperty={@personName=Christopher Robin}}
- {@NameProperty={@personName=Bart Simpson} name}
- {@NameProperty={@personName=Thomas Matthews} name}
- {@NameProperty={@personName=Christopher Robin} name}

>> property: Standalone NameProperty name
- {@NameProperty=name}

> Add() examples for NameProperty and personName
- {@Add()=add {@NameProperty={@personName=Christopher Robin} name}}
- {@Add()=add {@NameProperty={@personName=Bart Simpson} name}}
- {@Add()=add {@NameProperty={@personName=Thomas Matthews} name}}
- {@Add()=with {@NameProperty={@personName=Christopher Robin}}}
- {@Add()=with {@NameProperty={@personName=Thomas Matthews}}}
- {@Add()={@NameProperty=name is {@personName=Thomas Matthews}}}
- {@Add()={@NameProperty=name is {@personName=Christopher Robin}}}
- {@Add()={@NameProperty=name is {@personName=Bart Simpson}}}
- {@Add()={@NameProperty=name of {@personName=Bart Simpson}}}
- {@Add()={@NameProperty=name of {@personName=Thomas Matthews}}}
- {@Add()={@NameProperty=name of {@personName=Christopher Robin}}}

> Remove() examples for NameProperty and personName
- {@Remove()=remove {@NameProperty={@personName=Bart Simpson}}
- {@Remove()=remove {@NameProperty={@personName=Christopher Robin}}
- {@Remove()=remove {@NameProperty={@personName=Thomas Matthews}}
- {@Remove()=with no {@personName=Bart Simpson} name}
- {@Remove()=with no {@personName=Christopher Robin} name}
- {@Remove()=with no {@personName=Thomas Matthews} name}

> Clear() examples for NameProperty
- {@Clear()=clear {@NameProperty=name}}
- {@Clear()=reset {@NameProperty=name}}

> Show() examples for NameProperty
- {@Show()=show {@NameProperty=name}}
- {@Show()=value of {@NameProperty=name}}
- {@Show()={@NameProperty=name} values}
- {@Show()={@NameProperty=name} selection}

> Help() examples for NameProperty
- {@Help()=help {@NameProperty=name}}
- {@Help()=what can I say for {@NameProperty=name}}
- {@Help()={@NameProperty=name} help}

> Change() examples for NameProperty
- {@Change()=change {@NameProperty=name}}
- {@Change()=goto {@NameProperty=name}}



> Generator: 31cb37d38f20d77ad53b52631dca4f0a