
@ prebuilt number


> Define phrase list for Quantity property.
@ phraselist QuantityPhrases(interchangeable)=
		- quantity

> Define property entity and optional value for Quantity property.
@ ml QuantityProperty usesFeature QuantityPhrases
    - @ number number

> Define operations on 'Quantity' property.
@ ml Add() usesFeature AddPhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number

@ ml Remove() usesFeature RemovePhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number

@ ml Clear() usesFeature ClearPhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number

@ ml Change() usesFeature ChangePhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number

@ ml Show() usesFeature ShowPhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number

@ ml Help() usesFeature HelpPhrases
	-@ ml QuantityProperty usesFeature QuantityProperty
		- @ number number


> Add examples for operations on the 'Quantity' property to the intent 'sandwich'.
# sandwich
>> entity: Standalone QuantityProperty with number
- {@QuantityProperty={@number=1}}
- {@QuantityProperty={@number=32.4}}
- {@QuantityProperty={@number=99}}
- {@QuantityProperty={@number=215}}
- {@QuantityProperty={@number=1000}}
- {@QuantityProperty={@number=1} quantity}
- {@QuantityProperty={@number=32.4} quantity}
- {@QuantityProperty={@number=99} quantity}
- {@QuantityProperty={@number=215} quantity}
- {@QuantityProperty={@number=1000} quantity}

>> property: Standalone QuantityProperty name
- {@QuantityProperty=quantity}

> Add() examples for QuantityProperty and number
- {@Add()=add {@QuantityProperty={@number=32.4} quantity}}
- {@Add()=add {@QuantityProperty={@number=1} quantity}}
- {@Add()=add {@QuantityProperty={@number=215} quantity}}
- {@Add()=with {@QuantityProperty={@number=215}}}
- {@Add()=with {@QuantityProperty={@number=99}}}
- {@Add()=with {@QuantityProperty={@number=1000}}}
- {@Add()={@QuantityProperty=quantity is {@number=99}}}
- {@Add()={@QuantityProperty=quantity is {@number=215}}}
- {@Add()={@QuantityProperty=quantity is {@number=32.4}}}
- {@Add()={@QuantityProperty=quantity of {@number=1}}}
- {@Add()={@QuantityProperty=quantity of {@number=32.4}}}
- {@Add()={@QuantityProperty=quantity of {@number=99}}}

> Remove() examples for QuantityProperty and number
- {@Remove()=remove {@QuantityProperty={@number=1000}}
- {@Remove()=remove {@QuantityProperty={@number=32.4}}
- {@Remove()=remove {@QuantityProperty={@number=1}}
- {@Remove()=with no {@number=1} quantity}
- {@Remove()=with no {@number=32.4} quantity}
- {@Remove()=with no {@number=215} quantity}

> Clear() examples for QuantityProperty
- {@Clear()=clear {@QuantityProperty=quantity}}
- {@Clear()=reset {@QuantityProperty=quantity}}

> Show() examples for QuantityProperty
- {@Show()=show {@QuantityProperty=quantity}}
- {@Show()=value of {@QuantityProperty=quantity}}
- {@Show()={@QuantityProperty=quantity} values}
- {@Show()={@QuantityProperty=quantity} selection}

> Help() examples for QuantityProperty
- {@Help()=help {@QuantityProperty=quantity}}
- {@Help()=what can I say for {@QuantityProperty=quantity}}
- {@Help()={@QuantityProperty=quantity} help}

> Change() examples for QuantityProperty
- {@Change()=change {@QuantityProperty=quantity}}
- {@Change()=goto {@QuantityProperty=quantity}}



> Generator: 7e16b042d2a3b0db5c7ff23bac626173