
# test
- abc

# test1
- xyz

# test2
- 123

> test::test test -> test1 -> test2 -> s1 -> test
@ intent test usesFeature test1

> test1::test test1 -> test2 -> s1 -> test
@ intent test1 usesFeature test2

> test2::test test2 -> s1 -> test
@ intent test2 usesFeature s1

> s1::test s1 -> test
@ ml s1
@ s1 usesFeature test
